MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
/*
 * erf32_soc_mesh.c
 *
 *  Created on: 2020Äê11ÔÂ26ÈÕ
 *      Author: mi
 */
#include <stdio.h>
#include <string.h>
#include "mible_mesh_api.h"
#include "mi_config.h"
#include "mible_log.h"
#include "mible_api.h"
#include "efr32_api.h"
#include "mesh_auth/mible_mesh_auth.h"
#include "mesh_auth/mible_mesh_device.h"
#include "mijia_profiles/mi_service_server.h"

#include <mesh_sizes.h>
#include <gecko_configuration.h>
#include "bg_types.h"
#include "native_gecko.h"
#include "gatt_db.h"
#include "mesh_app_memory_config.h"
#include "em_rtcc.h"

/* Bluetooth stack headers */
#include "mesh_generic_model_capi_types.h"
#include "mesh_lighting_model_capi_types.h"
#include "mesh_lib.h"

#ifndef MI_MESH_LOW_POWER_NODE
#define MI_MESH_LOW_POWER_NODE  0
#endif

#define PRIMARY_ELEM        0
#define SECONDARY_ELEM      1
#define TERTIARY_ELEM       3

#define DEFAULT_TTL         5
#define RELAY_EN            0
#define RELAY_STEP          50
#define RELAY_RETRANS_CNT   2
#define NETTX_STEP          10
#define NETTX_CNT           7
#define PEND_ACK_BASE       (150+NETTX_STEP*NETTX_CNT)
#define PEND_ACK_STEP       (NETTX_STEP)
#define WAIT_ACK_BASE       (200+NETTX_STEP*NETTX_CNT)
#define WAIT_ACK_STEP       (NETTX_STEP)
#define SEGMENT_DELAY       (NETTX_STEP*NETTX_CNT + 20)
#define MAX_SAR_RETRY       3

#define GATT_CONN_TIMEOUT                       30   //30s

#define TIMER_ID_POLL_SECOND                    0XF0
#define TIMER_ID_CONN_TIMEOUT                   0XF1

static const uint8_t miot_spec_opcode_set[] = {
        [0] = MIBLE_MESH_MIOT_SPEC_GET&0x3F,
        [1] = MIBLE_MESH_MIOT_SPEC_SET&0x3F,
        [2] = MIBLE_MESH_MIOT_SPEC_SET_NOACK&0x3F,
        [3] = MIBLE_MESH_MIOT_SPEC_STATUS&0x3F,
        [4] = MIBLE_MESH_SYNC_PROPS_REQ&0x3F,
        [5] = MIBLE_MESH_SYNC_PROPS_RSP&0x3F,
        [6] = MIBLE_MESH_MIOT_SPEC_EVENT&0x3F,
        [7] = MIBLE_MESH_MIOT_SPEC_EVENT_TLV&0x3F,
        [8] = MIBLE_MESH_MIOT_SPEC_ACTION&0x3F,
        [9] = MIBLE_MESH_MIOT_SPEC_ACTION_ACK&0x3F,
        [10]= MIBLE_MESH_MIOT_SPEC_INDICATION&0x3F,
        [11]= MIBLE_MESH_MIOT_SPEC_INDICATION_ACK&0x3F,
        [12] = MIBLE_MESH_MIOT_SPEC_VENDOR_CONFIG_REQ&0x3F,
        [13] = MIBLE_MESH_MIOT_SPEC_VENDOR_CONFIG_RSP&0x3F
};

static uint64_t systime = 0;
static uint32_t rtc_cnt = 0;
static uint8_t is_provisioned = 0;
static uint8_t conn_handle = 0xFF;        /* handle of the last opened LE connection */

extern int mesh_event_cnt;
extern int non_mesh_event_cnt;

/**
 *@brief    async method, init mesh stack.
 *          report event: MIBLE_MESH_EVENT_STACK_INIT_DONE, data: NULL.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_init_stack(void)
{
    gecko_bgapi_class_mesh_node_init();
    gecko_bgapi_class_mesh_vendor_model_init();
    gecko_bgapi_class_mesh_test_init();
#ifndef MI_MESH_TEMPLATE_CLOUD
    gecko_bgapi_class_mesh_generic_server_init();
#endif

    uint16_t result = gecko_cmd_mesh_test_set_sar_config(10000,
                                                PEND_ACK_BASE,
                                                PEND_ACK_STEP,
                                                WAIT_ACK_BASE,
                                                WAIT_ACK_STEP,
                                                MAX_SAR_RETRY)->result;
    MI_ERR_CHECK(result);

    result = gecko_cmd_mesh_test_set_segment_send_delay(SEGMENT_DELAY)->result;
    MI_ERR_CHECK(result);

    return 0;
}
/**
 *@brief    deinit mesh stack.
 *          report event: MIBLE_MESH_EVENT_STACK_DEINIT_DONE, data: NULL.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_deinit_stack(void)
{
    return 0;
}

/**
 *@brief    async method, init mesh device
 *          load self info, include unicast address, iv, seq_num, init model;
 *          clear local db, related appkey_list, netkey_list, device_key_list,
 *          we will load latest data for cloud;
 *          report event: MIBLE_MESH_EVENT_PROVISIONER_INIT_DONE, data: NULL.
 *@param    [in] info : init parameters corresponding to gateway
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_init_node(void)
{
    uint16_t result = 0;

    result = gecko_cmd_mesh_node_init()->result;
    if (result) {
        MI_LOG_ERROR("mesh stack init failed 0x%04X\n", result);
    }
    MI_ERR_CHECK(result);

    return 0;
}

/***************************************************************************//**
 * This function process the requests for the generic model.
 *
 * @param[in] model_id       Server model ID.
 * @param[in] element_index  Server model element index.
 * @param[in] client_addr    Address of the client model which sent the message.
 * @param[in] server_addr    Address the message was sent to.
 * @param[in] appkey_index   The application key index used in encrypting the request.
 * @param[in] request        Pointer to the request structure.
 * @param[in] transition_ms  Requested transition time (in milliseconds).
 * @param[in] delay_ms       Delay time (in milliseconds).
 * @param[in] request_flags  Message flags. Bitmask of the following:
 *                           - Bit 0: Nonrelayed. If nonzero indicates
 *                                    a response to a nonrelayed request.
 *                           - Bit 1: Response required. If nonzero client
 *                                    expects a response from the server.
 ******************************************************************************/
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) \
    || defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN)
static void generic_request(uint16_t model_id,
                          uint16_t element_index,
                          uint16_t client_addr,
                          uint16_t server_addr,
                          uint16_t appkey_index,
                          const struct mesh_generic_request *request,
                          uint32_t transition_ms,
                          uint16_t delay_ms,
                          uint8_t request_flags)
{
    mible_mesh_event_params_t evt_generic_param;

    MI_LOG_INFO("ON/OFF request: requested state=<%s>, transition=%lu, delay=%u\r\n",
                request->on_off ? "ON" : "OFF", transition_ms, delay_ms);

