MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
    memset(&evt_generic_param.generic_msg, 0, sizeof(mible_mesh_access_message_t));
    switch(request->kind){
    case mesh_generic_request_on_off:
        evt_generic_param.generic_msg.opcode.opcode = MIBLE_MESH_MSG_GENERIC_ONOFF_SET;
        evt_generic_param.generic_msg.buf = (uint8_t*)&(request->on_off);
        evt_generic_param.generic_msg.buf_len = sizeof(uint8_t);
        break;
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL)
    case mesh_lighting_request_lightness_actual:
        evt_generic_param.generic_msg.opcode.opcode = MIBLE_MESH_MSG_LIGHT_LIGHTNESS_SET;
        evt_generic_param.generic_msg.buf = (uint8_t*)&(request->lightness);
        evt_generic_param.generic_msg.buf_len = sizeof(uint16_t);
        break;
#if defined(MI_MESH_TEMPLATE_LIGHTCTL)
    case mesh_lighting_request_ctl_temperature:
        evt_generic_param.generic_msg.opcode.opcode = MIBLE_MESH_MSG_LIGHT_CTL_TEMPERATURE_SET;
        evt_generic_param.generic_msg.buf = (uint8_t*)&(request->ctl_temperature);
        evt_generic_param.generic_msg.buf_len = sizeof(uint16_t) + sizeof(int16_t);
        break;
#endif
#endif
    default:
        MI_LOG_ERROR("can't find request type %d\r\n",request->kind);
        return;
    }
    evt_generic_param.generic_msg.opcode.company_id = MIBLE_MESH_COMPANY_ID_SIG;
    evt_generic_param.generic_msg.meta_data.dst_addr = server_addr;
    evt_generic_param.generic_msg.meta_data.src_addr = client_addr;
    evt_generic_param.generic_msg.meta_data.elem_index = element_index;

    mible_mesh_event_callback(MIBLE_MESH_EVENT_GENERIC_MESSAGE_CB, &evt_generic_param);
}
#endif

/***************************************************************************//**
 * Initialization of the models supported by this node.
 * This function registers callbacks for each of the supported models.
 ******************************************************************************/
static int init_sig_models(void)
{
    uint16_t result;
    /* Initialize mesh lib */
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN)
    mesh_lib_init(malloc, free, 1);
#elif defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_LIGHTCTL)
    mesh_lib_init(malloc, free, 2);
#elif defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH)
    mesh_lib_init(malloc, free, 3);
#endif

#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) \
    || defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN)
    result = gecko_cmd_mesh_generic_server_init_on_off()->result;
    MI_ERR_CHECK(result);
    result = mesh_lib_generic_server_register_handler(MIBLE_MESH_MODEL_ID_GENERIC_ONOFF_SERVER,
                                            PRIMARY_ELEM,
                                            generic_request,
                                            NULL,
                                            NULL);
    MI_ERR_CHECK(result);
#endif
#if defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH)
    result = mesh_lib_generic_server_register_handler(MIBLE_MESH_MODEL_ID_GENERIC_ONOFF_SERVER,
                                            SECONDARY_ELEM,
                                            generic_request,
                                            NULL,
                                            NULL);
    MI_ERR_CHECK(result);
#endif
#if defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH)
    result = mesh_lib_generic_server_register_handler(MIBLE_MESH_MODEL_ID_GENERIC_ONOFF_SERVER,
                                            TERTIARY_ELEM,
                                            generic_request,
                                            NULL,
                                            NULL);
    MI_ERR_CHECK(result);
#endif

#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL)
    result = gecko_cmd_mesh_generic_server_init_lightness()->result;
    MI_ERR_CHECK(result);
    result = mesh_lib_generic_server_register_handler(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                                            PRIMARY_ELEM,
                                            generic_request,
                                            NULL,
                                            NULL);
    MI_ERR_CHECK(result);
#endif
#if defined(MI_MESH_TEMPLATE_LIGHTCTL)
    result = gecko_cmd_mesh_generic_server_init_ctl()->result;
    MI_ERR_CHECK(result);
    result = mesh_lib_generic_server_register_handler(MESH_LIGHTING_CTL_TEMPERATURE_SERVER_MODEL_ID,
                                            SECONDARY_ELEM,
                                            generic_request,
                                            NULL,
                                            NULL);
    MI_ERR_CHECK(result);
#endif

#ifndef MI_MESH_TEMPLATE_CLOUD
    result = gecko_cmd_mesh_generic_server_init_common()->result;
    MI_ERR_CHECK(result);
#endif
    return result;
}

static void local_config_init(void)
{
    uint16_t result;

    result = init_sig_models();
    MI_ERR_CHECK(result);
    result = gecko_cmd_mesh_vendor_model_init(  0,
                                                MIBLE_MESH_COMPANY_ID_XIAOMI,
                                                MIBLE_MESH_MIOT_SPEC_SERVER_MODEL,
                                                0,
                                                sizeof(miot_spec_opcode_set),
                                                miot_spec_opcode_set)->result;
    MI_ERR_CHECK(result);
    result = gecko_cmd_mesh_vendor_model_init(  0,
                                                MIBLE_MESH_COMPANY_ID_XIAOMI,
                                                MIBLE_MESH_MIJIA_SERVER_MODEL,
                                                0,
                                                0,
                                                NULL)->result;
    MI_ERR_CHECK(result);

    result = gecko_cmd_mesh_test_set_nettx(NETTX_CNT, NETTX_STEP/10-1)->result;
    MI_ERR_CHECK(result);
    result = gecko_cmd_mesh_test_set_relay(RELAY_EN, RELAY_RETRANS_CNT, RELAY_STEP/10-1)->result;
    MI_ERR_CHECK(result);
    result = gecko_cmd_mesh_node_set_iv_update_age(691200)->result;
    MI_LOG_INFO("gecko_cmd_mesh_node_set_iv_update_age %d\r\n", result);
    MI_ERR_CHECK(result);

    MI_LOG_INFO("local configuration server config.\n");
    uint8_t var = DEFAULT_TTL;
    result = gecko_cmd_mesh_test_set_local_config(mesh_node_default_ttl, 0, sizeof(var), &var)->result;
    MI_ERR_CHECK(result);
    var = 1;
    result = gecko_cmd_mesh_test_set_local_config(mesh_node_beacon, 0, sizeof(var), &var)->result;
    MI_ERR_CHECK(result);
    var = 0;

#ifdef MI_LOG_ENABLED
    struct gecko_msg_mesh_test_get_nettx_rsp_t *p_nettx = gecko_cmd_mesh_test_get_nettx();
    MI_LOG_WARNING("nettx\t cnt %d\t interval %d\n", p_nettx->count, (p_nettx->interval+1)*10);

    struct gecko_msg_mesh_test_get_relay_rsp_t *p_relay = gecko_cmd_mesh_test_get_relay();
    MI_LOG_WARNING("relay\t stat %d\t cnt %d\t interval %d\n", p_relay->enabled, p_relay->count, (p_relay->interval+1)*10);

