MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
    uint8_t friend = gecko_cmd_mesh_test_get_local_config(mesh_node_friendship, 0)->data.data[0];
    uint8_t beacon = gecko_cmd_mesh_test_get_local_config(mesh_node_beacon, 0)->data.data[0];
    uint8_t ttl = gecko_cmd_mesh_test_get_local_config(mesh_node_default_ttl, 0)->data.data[0];
    uint8_t proxy = gecko_cmd_mesh_test_get_local_config(mesh_node_gatt_proxy, 0)->data.data[0];
    uint8_t identity = gecko_cmd_mesh_test_get_local_config(mesh_node_identity, 0)->data.data[0];
    MI_LOG_INFO("friend: %d  beacon: %d  ttl: %d  proxy: %d  identity: %d\n", friend, beacon, ttl, proxy, identity);
#endif
}

/**
 *@brief    set node provsion data.
 *@param    [in] param : prov data include devkey, netkey, netkey idx,
 *          uni addr, iv idx, key flag
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_provsion_data(mible_mesh_provisioning_data_t *param)
{
    uint16_t result = 0;
    MI_LOG_WARNING("[mible_mesh_gateway_set_model_app] \n");
    aes_key_128 devkey, netkey;
    memcpy(devkey.data, param->devkey, 16);
    memcpy(netkey.data, param->netkey, 16);
    result = gecko_cmd_mesh_node_set_provisioning_data(
            devkey,
            netkey,
            param->net_idx,
            param->iv,
            param->address,
            param->flags & 0x01)->result;
    MI_ERR_CHECK(result);
    return result;
}

/**
 *@brief    mesh provsion done. need update node info and
 *          callback MIBLE_MESH_EVENT_DEVICE_INIT_DONE event
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_provsion_done(void)
{
    return mible_reboot();
}

/**
 *@brief    reset node, 4.3.2.53 Config Node Reset, Report 4.3.2.54 Config Node Reset Status.
 *          report event: MIBLE_MESH_EVENT_CONFIG_MESSAGE_CB, data: mible_mesh_config_status_t.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_node_reset(void)
{
    // erase mesh data
    return gecko_cmd_mesh_node_reset()->result;
}

/**
 *@brief    mesh unprovsion done. need update node info and
 *          callback MIBLE_MESH_EVENT_DEVICE_INIT_DONE event
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_unprovsion_done(void)
{
    return mible_reboot();
}

/**
 *@brief    mesh login done.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_login_done(uint8_t status)
{
    MI_LOG_INFO("LOGIN SUCCESS, stop TIMER_ID_CONN_TIMEOUT\n");
    return gecko_cmd_hardware_set_soft_timer(0, TIMER_ID_CONN_TIMEOUT, 1)->result;
}

/**
 *@brief    set local provisioner network transmit params.
 *@param    [in] count : advertise counter for every adv packet, adv transmit times
 *@param    [in] interval_steps : adv interval = interval_steps*0.625ms
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_network_transmit_param(uint8_t count, uint8_t interval_steps)
{
    uint16_t result;
    MI_LOG_WARNING("[mible_mesh_gateway_set_network_transmit_param] \n");
    result = gecko_cmd_mesh_test_set_nettx(count, interval_steps)->result;
    MI_ERR_CHECK(result);
    return 0;
}

/**
 *@brief    set node relay onoff.
 *@param    [in] enabled : 0: relay off, 1: relay on
 *@param    [in] count: Number of relay transmissions beyond the initial one. Range: 0-7
 *@param    [in] interval: Relay retransmit interval steps. 10*(1+steps) milliseconds. Range: 0-31.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_relay(uint8_t enabled, uint8_t count, uint8_t interval)
{
    uint16_t result;
    result = gecko_cmd_mesh_test_set_relay(enabled, count, interval)->result;
    MI_ERR_CHECK(result);
    return result;
}

/**
 *@brief    get node relay state.
 *@param    [out] enabled : 0: relay off, 1: relay on
 *@param    [out] count: Number of relay transmissions beyond the initial one. Range: 0-7
 *@param    [out] interval: Relay retransmit interval steps. 10*(1+steps) milliseconds. Range: 0-31.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_get_relay(uint8_t *enabled, uint8_t *count, uint8_t *step)
{
    struct gecko_msg_mesh_test_get_relay_rsp_t *p_relay = gecko_cmd_mesh_test_get_relay();
    MI_LOG_WARNING("relay\t stat %d\t cnt %d\t interval %d\n", p_relay->enabled, p_relay->count, (p_relay->interval+1)*10);

    *enabled = p_relay->enabled;
    *count = p_relay->count;
    *step = p_relay->interval;

    return p_relay->result;
}

/**
 *@brief    get seq number.
 *@param    [in] element : model element
 *@param    [out] seq : current sequence numer
 *@param    [out] iv_index : current IV Index
 *@param    [out] flags : IV Update Flag
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_get_seq(uint16_t element, uint32_t* seq, uint32_t* iv, uint8_t* flags)
{
    if(is_provisioned){
        if(seq != NULL)
            *seq = gecko_cmd_mesh_test_get_element_seqnum(element)->seqnum;
        if(iv != NULL)
            *iv = gecko_cmd_mesh_node_get_ivupdate_state()->ivindex;
        if(flags != NULL)
            *flags = gecko_cmd_mesh_node_get_ivupdate_state()->state;
        return 0;
    }
    return -1;
}

/**
 *@brief    update iv index, .
 *@param    [in] iv_index : current IV Index
 *@param    [in] flags : contains the Key Refresh Flag and IV Update Flag
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_update_iv_info(uint32_t iv_index, uint8_t flags)
{
    MI_LOG_WARNING("[mible_mesh_gateway_update_iv_info]  \n");
    if(gecko_cmd_mesh_test_set_iv_index(iv_index)->result != 0){
        MI_LOG_ERROR("set iv index error. \n");
        return -1;
    }
    if(gecko_cmd_mesh_test_set_ivupdate_state(flags)->result != 0){
        MI_LOG_ERROR("set ivupdate state error. \n");
        return -2;
    }
    return 0;
}

/**
 *@brief    add/delete local netkey.
 *@param    [in] op : add or delete
 *@param    [in] netkey_index : key index for netkey
 *@param    [in] netkey : netkey value
 *@param    [in|out] stack_netkey_index : [in] default value: 0xFFFF, [out] stack generates netkey_index
 *          if your stack don't manage netkey_index and stack_netkey_index relationships, update stack_netkey_index.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_netkey(mible_mesh_op_t op, uint16_t netkey_index, uint8_t *netkey)
{
    MI_LOG_WARNING("[mible_mesh_gateway_set_netkey] \n");
    aes_key_128 key;
    memcpy(key.data, netkey, 16);
    if(op == MIBLE_MESH_OP_ADD){
        if(gecko_cmd_mesh_test_add_local_key(0, key, netkey_index, 0xFFFF)->result != 0){
            MI_LOG_ERROR("set netkey error. \n");
            return -1;
        }
#if !MINIMIZE_FLASH_SIZE
    }else{
        if(gecko_cmd_mesh_test_del_local_key(0, netkey_index)->result != 0){
            MI_LOG_ERROR("delete netkey error. \n");
            return -2;
        }
#endif
    }
    return 0;
}

/**
 *@brief    add/delete local appkey.
 *@param    [in] op : add or delete
 *@param    [in] netkey_index : key index for netkey
 *@param    [in] appkey_index : key index for appkey
 *@param    [in] appkey : appkey value
 *@param    [in|out] stack_appkey_index : [in] default value: 0xFFFF, [out] stack generates appkey_index
 *          if your stack don't manage appkey_index and stack_appkey_index relationships, update stack_appkey_index.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_appkey(mible_mesh_op_t op, uint16_t netkey_index, uint16_t appkey_index, uint8_t * appkey)
{
    MI_LOG_WARNING("[mible_mesh_gateway_set_appkey] \n");
    aes_key_128 key;
    memcpy(key.data, appkey, 16);
    if(op == MIBLE_MESH_OP_ADD){
        if(gecko_cmd_mesh_test_add_local_key(1, key, appkey_index, netkey_index)->result != 0){
            MI_LOG_ERROR("set appkey error. \n");
            return -1;
        }
        //*stack_appkey_index = appkey_index;
#if !MINIMIZE_FLASH_SIZE
    }else{
        if(gecko_cmd_mesh_test_del_local_key(1, appkey_index)->result != 0){
            MI_LOG_ERROR("delete appkey error. \n");
            return -2;
        }
        //*stack_appkey_index = appkey_index;
#endif
    }
    return 0;
}

/**
 *@brief    bind/unbind model app.
 *@param    [in] op : bind is MIBLE_MESH_OP_ADD, unbind is MIBLE_MESH_OP_DELETE
 *@param    [in] company_id: company id
 *@param    [in] model_id : model_id
 *@param    [in] appkey_index : key index for appkey
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_model_app(mible_mesh_op_t op, uint16_t elem_index, uint16_t company_id, uint16_t model_id, uint16_t appkey_index)
{
    uint16_t result = 0;
    if(op == MIBLE_MESH_OP_ADD){
        result = gecko_cmd_mesh_test_bind_local_model_app(elem_index, appkey_index,
                company_id == 0? 0xFFFF: company_id, model_id)->result;
        MI_LOG_DEBUG("[model bind] company_id = %x, model_id = %x, appkey_index = %x, result = %x \n", company_id, model_id, appkey_index, result);
#if !MINIMIZE_FLASH_SIZE
    }else{
        result = gecko_cmd_mesh_test_unbind_local_model_app(elem_index, appkey_index,
                company_id == 0? 0xFFFF: company_id, model_id)->result;
        MI_LOG_DEBUG("[model unbind] company_id = %x, model_id = %x, appkey_index = %x, result = %x \n", company_id, model_id, appkey_index, result);
#endif
    }
    return result;
}

/**
 *@brief    add/delete subscription params.
 *@param    [in] op : add or delete
 *@param    [in] element : model element
 *@param    [in] company_id: company id
 *@param    [in] model_id : model_id
 *@param    [in] sub_addr: subscription address params
 *@return   0: success, negetive value: failure
 */
int mible_mesh_device_set_sub_address(mible_mesh_op_t op, uint16_t element, uint16_t company_id, uint16_t model_id, uint16_t sub_addr)
{
    uint16_t result = 0;
    struct gecko_msg_mesh_test_get_local_model_sub_rsp_t* p = gecko_cmd_mesh_test_get_local_model_sub(
            element, company_id == 0? 0xFFFF : company_id, model_id);
    MI_LOG_INFO("[set_sub_address]op: %s, elem %d, model %04x, subaddr %04x, sub_list:\n",
                op? "del":"add", element, model_id, sub_addr, p->result);
    MI_LOG_HEXDUMP(p->addresses.data, p->addresses.len);

    if (p->result != bg_err_success){
        MI_LOG_ERROR("model %04X cid %04X has no sub ?\n", model_id, company_id);
        return -1;
    }

    if(op == MIBLE_MESH_OP_ADD){
        if (p->addresses.len && memcmp(&sub_addr, p->addresses.data, p->addresses.len) == 0) {
            return 0;
        }
        /* delete all subaddr */
        for (uint8_t i = 0; i < p->addresses.len; i+=2) {
            uint16_t addr = p->addresses.data[i] + (p->addresses.data[i+1]<<8);
            result = gecko_cmd_mesh_test_del_local_model_sub(element,
                    company_id == 0? 0xFFFF : company_id, model_id, addr)->result;
            MI_ERR_CHECK(result);
        }
        result = gecko_cmd_mesh_test_add_local_model_sub(element,
                company_id == 0? 0xFFFF : company_id, model_id, sub_addr)->result;
        MI_ERR_CHECK(result);
    }else{
        if(p->addresses.len){
            result = gecko_cmd_mesh_test_del_local_model_sub(element,
                        company_id == 0? 0xFFFF : company_id, model_id, sub_addr)->result;
            MI_ERR_CHECK(result);
        }
    }

