MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
    return 0;
}

/**
 *@brief    generic message, Mesh model 3.2, 4.2, 5.2, 6.3, or 7 Summary.
 *          report event: MIBLE_MESH_EVENT_GENERIC_OPTION_CB, data: mible_mesh_access_message_t.
 *@param    [in] param : control parameters corresponding to node
 *          according to opcode, generate a mesh message; extral params: ack_opcode, tid, get_or_set.
 *@return   0: success, negetive value: failure
 */
int mible_mesh_node_generic_control(mible_mesh_access_message_t *param)
{
    int result = 0;
    struct mesh_generic_state current;
    switch(param->opcode.opcode){
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) \
    || defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN)
    case MIBLE_MESH_MSG_GENERIC_ONOFF_STATUS:
        MI_LOG_DEBUG("Generic onoff model message send. src %04x, dst %04x, opcode %04x, data:\n",
                param->meta_data.src_addr, param->meta_data.dst_addr, param->opcode.opcode);
        MI_LOG_HEXDUMP(param->buf, param->buf_len);
        current.kind = mesh_generic_state_on_off;
        memcpy(&(current.on_off), param->buf, sizeof(uint8_t));
        result = mesh_lib_generic_server_update(MESH_GENERIC_ON_OFF_SERVER_MODEL_ID,
                param->meta_data.elem_index, &current, &current, 0);
        MI_ERR_CHECK(result);
        result = mesh_lib_generic_server_response(MESH_GENERIC_ON_OFF_SERVER_MODEL_ID,
                param->meta_data.elem_index, param->meta_data.dst_addr,
                param->meta_data.appkey_index, &current, &current, 0, 0);
        MI_ERR_CHECK(result);
        break;
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL)
    case MIBLE_MESH_MSG_LIGHT_LIGHTNESS_STATUS:
        MI_LOG_DEBUG("Light lightness model message send. src %04x, dst %04x, opcode %04x, data:\n",
                param->meta_data.src_addr, param->meta_data.dst_addr, param->opcode.opcode);
        MI_LOG_HEXDUMP(param->buf, param->buf_len);
        current.kind = mesh_lighting_state_lightness_actual;
        memcpy(&(current.lightness), param->buf, sizeof(uint16_t));
        result = mesh_lib_generic_server_update(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                param->meta_data.elem_index, &current, &current, 0);
        MI_ERR_CHECK(result);
        result = mesh_lib_generic_server_response(MESH_LIGHTING_LIGHTNESS_SERVER_MODEL_ID,
                param->meta_data.elem_index, param->meta_data.dst_addr,
                param->meta_data.appkey_index, &current, &current, 0, 0);
        MI_ERR_CHECK(result);
        break;
#endif
#if defined(MI_MESH_TEMPLATE_LIGHTCTL)
    case MIBLE_MESH_MSG_LIGHT_CTL_TEMPERATURE_STATUS:
        MI_LOG_DEBUG("Light lightness model message send. src %04x, dst %04x, opcode %04x, data:\n",
                param->meta_data.src_addr, param->meta_data.dst_addr, param->opcode.opcode);
        MI_LOG_HEXDUMP(param->buf, param->buf_len);
        current.kind = mesh_lighting_state_ctl_temperature;
        memcpy(&(current.ctl_temperature), param->buf, sizeof(uint32_t));
        result = mesh_lib_generic_server_update(MESH_LIGHTING_CTL_TEMPERATURE_SERVER_MODEL_ID,
                param->meta_data.elem_index, &current, &current, 0);
        MI_ERR_CHECK(result);
        result = mesh_lib_generic_server_response(MESH_LIGHTING_CTL_TEMPERATURE_SERVER_MODEL_ID,
                param->meta_data.elem_index, param->meta_data.dst_addr,
                param->meta_data.appkey_index, &current, &current, 0, 0);
        MI_ERR_CHECK(result);
        break;
#endif
#endif
    case MIBLE_MESH_MIOT_SPEC_STATUS:
    case MIBLE_MESH_SYNC_PROPS_REQ:
    case MIBLE_MESH_MIOT_SPEC_EVENT:
    case MIBLE_MESH_MIOT_SPEC_EVENT_TLV:
    case MIBLE_MESH_MIOT_SPEC_ACTION_ACK:
    case MIBLE_MESH_MIOT_SPEC_INDICATION:
    case MIBLE_MESH_MIOT_SPEC_VENDOR_CONFIG_RSP:
        MI_LOG_DEBUG("VVVVVVVVVVVendor model message send. src %04x, dst %04x, opcode %04x, data:\n",
                param->meta_data.src_addr, param->meta_data.dst_addr, param->opcode.opcode);
        MI_LOG_HEXDUMP(param->buf, param->buf_len);
        result = gecko_cmd_mesh_vendor_model_send(0, MIBLE_MESH_COMPANY_ID_XIAOMI,
                MIBLE_MESH_MIOT_SPEC_SERVER_MODEL, param->meta_data.dst_addr, 0,
                param->meta_data.appkey_index, 0, param->opcode.opcode&0x3F, 1,
                param->buf_len, param->buf)->result;
        MI_ERR_CHECK(result);
        break;
    }
    return result;
}

uint64_t mible_mesh_get_exact_systicks(void)
{
    uint32_t ticks = RTCC_CounterGet() - rtc_cnt;
    //MI_LOG_DEBUG("mible_mesh_get_exact_systicks %lld ms\n", systime*1000 + ticks*1000/32768);
    return systime*1000 + ticks*1000/32768;
}

static void process_mesh_node_init_event(struct gecko_cmd_packet *evt)
{
    mible_mesh_node_init_t node_info = {
        .map = {
            [0] = {
                .siid = 0,
                .piid = 0,
                .model_id = MIBLE_MESH_MIOT_SPEC_SERVER_MODEL,
                .company_id = MIBLE_MESH_COMPANY_ID_XIAOMI,
                .element = 0,
                .appkey_idx = 0,
            },
            [1] = {
                .siid = 0,
                .piid = 0,
                .model_id = MIBLE_MESH_MIJIA_SERVER_MODEL,
                .company_id = MIBLE_MESH_COMPANY_ID_XIAOMI,
                .element = 0,
                .appkey_idx = 0,
            },
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) \
    || defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN)
            [2] = {
                .siid = 2,
                .piid = 1,
                .model_id = MIBLE_MESH_MODEL_ID_GENERIC_ONOFF_SERVER,
                .company_id = MIBLE_MESH_COMPANY_ID_SIG,
                .element = 0,
                .appkey_idx = 0,
            },
    #if defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH)
            [3] = {
                .siid = 3,
                .piid = 1,
                .model_id = MIBLE_MESH_MODEL_ID_GENERIC_ONOFF_SERVER,
                .company_id = MIBLE_MESH_COMPANY_ID_SIG,
                .element = 1,
                .appkey_idx = 0,
            },
        #if defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH)
            [4] = {
                .siid = 4,
                .piid = 1,
                .model_id = MIBLE_MESH_MODEL_ID_GENERIC_ONOFF_SERVER,
                .company_id = MIBLE_MESH_COMPANY_ID_SIG,
                .element = 2,
                .appkey_idx = 0,
            },
        #else
            [4] = {0},
        #endif
    #elif defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL)
            [3] = {
                .siid = 2,
                .piid = 2,
                .model_id = MIBLE_MESH_MODEL_ID_LIGHTNESS_SERVER,
                .company_id = MIBLE_MESH_COMPANY_ID_SIG,
                .element = 0,
                .appkey_idx = 0,
            },
        #if defined(MI_MESH_TEMPLATE_LIGHTCTL)
            [4] = {
                .siid = 2,
                .piid = 3,
                .model_id = MIBLE_MESH_MODEL_ID_CTL_TEMPEATURE_SERVER,
                .company_id = MIBLE_MESH_COMPANY_ID_SIG,
                .element = 1,
                .appkey_idx = 0,
            },
        #else
            [4] = {0},
        #endif
    #else
            [3] = {0},
            [4] = {0},
    #endif
#else
            [2] = {0},
            [3] = {0},
            [4] = {0},
#endif
        },
    };
    node_info.provisioned = evt->data.evt_mesh_node_initialized.provisioned;
    node_info.lpn_node = MI_MESH_LOW_POWER_NODE;
    node_info.address = evt->data.evt_mesh_node_initialized.address;
    node_info.ivi = evt->data.evt_mesh_node_initialized.ivi;
    is_provisioned = node_info.provisioned;

    mible_mesh_event_callback(MIBLE_MESH_EVENT_DEVICE_INIT_DONE, &node_info);
}

static void process_mesh_vendor_model_recv_event(struct gecko_cmd_packet *evt)
{
    mible_mesh_event_params_t evt_vendor_param;

    memset(&evt_vendor_param.generic_msg, 0, sizeof(mible_mesh_access_message_t));
    evt_vendor_param.generic_msg.opcode.opcode = evt->data.evt_mesh_vendor_model_receive.opcode | 0xC0;
    evt_vendor_param.generic_msg.opcode.company_id = MIBLE_MESH_COMPANY_ID_XIAOMI;
    evt_vendor_param.generic_msg.meta_data.dst_addr = evt->data.evt_mesh_vendor_model_receive.destination_address;
    evt_vendor_param.generic_msg.meta_data.src_addr = evt->data.evt_mesh_vendor_model_receive.source_address;
    evt_vendor_param.generic_msg.buf = evt->data.evt_mesh_vendor_model_receive.payload.data;
    evt_vendor_param.generic_msg.buf_len = evt->data.evt_mesh_vendor_model_receive.payload.len;

    MI_LOG_INFO("vvvvvvendor model received, opcode %04x, data:\n", evt_vendor_param.generic_msg.opcode.opcode);
    MI_LOG_HEXDUMP(evt->data.evt_mesh_vendor_model_receive.payload.data, evt->data.evt_mesh_vendor_model_receive.payload.len);
    mible_mesh_event_callback(MIBLE_MESH_EVENT_GENERIC_MESSAGE_CB, &evt_vendor_param);
}

static void process_mesh_node_model_config(struct gecko_cmd_packet *evt)
{
    static uint16_t m_pri_group = 0;
    mible_mesh_event_params_t evt_vendor_param;
    memset(&evt_vendor_param.config_msg, 0, sizeof(mible_mesh_config_status_t));

    struct gecko_msg_mesh_node_model_config_changed_evt_t changed = evt->data.evt_mesh_node_model_config_changed;
    if(changed.mesh_node_config_state == 0x02){     //Model subscription list
        uint16_t m_pri_elem_addr = gecko_cmd_mesh_node_get_element_address(0)->address;
        struct gecko_msg_mesh_test_get_local_model_sub_rsp_t* p = gecko_cmd_mesh_test_get_local_model_sub(
                    changed.element_address - m_pri_elem_addr, changed.vendor_id, changed.model_id);
        if (p->result == bg_err_success) {
            evt_vendor_param.config_msg.opcode.company_id = MIBLE_MESH_COMPANY_ID_SIG;
            evt_vendor_param.config_msg.meta_data.dst_addr = changed.element_address;
            evt_vendor_param.config_msg.meta_data.elem_index = changed.element_address - m_pri_elem_addr;
            evt_vendor_param.config_msg.model_sub_set.elem_addr = changed.element_address;
            evt_vendor_param.config_msg.model_sub_set.model_id.model_id = changed.model_id;
            evt_vendor_param.config_msg.model_sub_set.model_id.company_id = changed.vendor_id;
            if(p->addresses.len){
                evt_vendor_param.config_msg.opcode.opcode = MIBLE_MESH_MSG_CONFIG_MODEL_SUBSCRIPTION_OVERWRITE;
                memcpy(&evt_vendor_param.config_msg.model_sub_set.address, p->addresses.data, 2);
                m_pri_group = evt_vendor_param.config_msg.model_sub_set.address - evt_vendor_param.config_msg.meta_data.elem_index;
                MI_LOG_INFO("[SUB OVERWRITE]model %04x, elem %d, group address %d\n", changed.model_id,
                            evt_vendor_param.config_msg.meta_data.elem_index, evt_vendor_param.config_msg.model_sub_set.address);
            }else{
                evt_vendor_param.config_msg.opcode.opcode = MIBLE_MESH_MSG_CONFIG_MODEL_SUBSCRIPTION_DELETE;
                evt_vendor_param.config_msg.model_sub_set.address = m_pri_group + evt_vendor_param.config_msg.meta_data.elem_index;
                MI_LOG_INFO("[SUB DELETE]model %04x, elem %d, group address %d\n", changed.model_id,
                            evt_vendor_param.config_msg.meta_data.elem_index, evt_vendor_param.config_msg.model_sub_set.address);
            }

            mible_mesh_event_callback(MIBLE_MESH_EVENT_CONFIG_MESSAGE_CB, &evt_vendor_param);
        }
    }else if(changed.mesh_node_config_state == 0x00){
        MI_LOG_INFO("[Model application key bindings]addr %04x, vendor %04x, model %04x\n",
                    changed.element_address, changed.vendor_id, changed.model_id);
    }else if(changed.mesh_node_config_state == 0x01){
        MI_LOG_INFO("[Model publication parameters]addr %04x, vendor %04x, model %04x\n",
                    changed.element_address, changed.vendor_id, changed.model_id);
    }
}

