MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
#if !MINIMIZE_FLASH_SIZE
static void process_mesh_node_config_set(struct gecko_cmd_packet *evt)
{
    mible_mesh_config_status_t config_msg;
    memset(&config_msg, 0, sizeof(mible_mesh_config_status_t));

    struct gecko_msg_mesh_node_config_set_evt_t config_set = evt->data.evt_mesh_node_config_set;
    if(config_set.id == mesh_node_relay){
        config_msg.opcode.opcode = MIBLE_MESH_MSG_CONFIG_RELAY_SET;
        config_msg.opcode.company_id = MIBLE_MESH_COMPANY_ID_SIG;
        config_msg.meta_data.netkey_index = config_set.netkey_index;
        config_msg.relay_set.relay = config_set.value.data[0];
        config_msg.relay_set.relay_retrans_cnt = config_set.value.data[1]&0x07;
        config_msg.relay_set.relay_retrans_intvlsteps = (config_set.value.data[1]&0xF8) >> 3;
        MI_LOG_INFO("[RELAY SET]relay %d, cnt %d, intval %d\n", config_msg.relay_set.relay,
                config_msg.relay_set.relay_retrans_cnt, config_msg.relay_set.relay_retrans_intvlsteps);
        MI_LOG_HEXDUMP(config_set.value.data, config_set.value.len);

        mible_mesh_event_params_t evt_vendor_param = {
            .config_msg = config_msg,
        };
        mible_mesh_event_callback(MIBLE_MESH_EVENT_CONFIG_MESSAGE_CB, &evt_vendor_param);
    }else{
        MI_LOG_INFO("[Node config]known id %d\n", config_set.id);
    }
}
#endif

static void process_mesh_node_reset(struct gecko_cmd_packet *evt)
{
    mible_mesh_event_params_t evt_vendor_param;

    /* if connection is open then close it before rebooting */
    if (conn_handle != 0xFF) {
        gecko_cmd_le_connection_close(conn_handle);
    }

    evt_vendor_param.config_msg.opcode.opcode = MIBLE_MESH_MSG_CONFIG_NODE_RESET;
    evt_vendor_param.config_msg.opcode.company_id = MIBLE_MESH_COMPANY_ID_SIG;

    mible_mesh_event_callback(MIBLE_MESH_EVENT_CONFIG_MESSAGE_CB, &evt_vendor_param);
}

static void process_mesh_iv_update_event(uint32_t iv_index, uint8_t flags)
{
    mible_mesh_iv_t mesh_iv;
    mesh_iv.iv_index = iv_index;
    mesh_iv.flags = flags;
    mible_mesh_event_callback(MIBLE_MESH_EVENT_IV_UPDATE, &mesh_iv);
}

#if defined(WATCH_DOG_ENABLE) && WATCH_DOG_ENABLE
#include "em_wdog.h"
#include "em_cmu.h"
/**************************************************************************//**
 * @brief Watchdog initialization
 *****************************************************************************/
void initWDOG(void)
{
  // Enable clock for the WDOG module
  CMU_ClockEnable(cmuClock_WDOG0, true);

  // Watchdog Initialize settings
  WDOG_Init_TypeDef wdogInit = WDOG_INIT_DEFAULT;
  CMU_ClockSelectSet(cmuClock_WDOG0, cmuSelect_ULFRCO); /* ULFRCO as clock source */
  wdogInit.debugRun = true;
  wdogInit.em3Run = true;
  wdogInit.perSel = wdogPeriod_16k; // 16385 clock cycles of a 1kHz clock  ~16 seconds period

  // Initializing watchdog with chosen settings
  WDOG_Init(&wdogInit);
}
#endif

static void process_soft_timer_event(struct gecko_cmd_packet *evt)
{
    switch (evt->data.evt_hardware_soft_timer.handle) {
    case TIMER_ID_POLL_SECOND:
        systime ++;
        rtc_cnt = RTCC_CounterGet();
#if defined(WATCH_DOG_ENABLE) && WATCH_DOG_ENABLE
        WDOG_Feed();
#endif
        MI_LOG_DEBUG("events: mesh %3d, others %3d. systime: %u\n",
                    mesh_event_cnt, non_mesh_event_cnt, (uint32_t)systime);
        mesh_event_cnt = 0;
        non_mesh_event_cnt = 0;
        // procedures run periodic
        if (is_provisioned && systime % 1800 == 0) {
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN) || defined(MI_MESH_TEMPLATE_CLOUD)
            uint32_t seq_remain = gecko_cmd_mesh_node_get_seq_remaining(0)->count;
#elif defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_LIGHTCTL)
            uint32_t seq_remain = MIN(gecko_cmd_mesh_node_get_seq_remaining(0)->count,
                                      gecko_cmd_mesh_node_get_seq_remaining(1)->count);
#elif defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH)
            uint32_t seq_remain = MIN(gecko_cmd_mesh_node_get_seq_remaining(0)->count,
                                  MIN(gecko_cmd_mesh_node_get_seq_remaining(1)->count,
                                      gecko_cmd_mesh_node_get_seq_remaining(2)->count));
#endif
            if (seq_remain < 0x100000 && gecko_cmd_mesh_node_get_ivupdate_state()->state == 0)
                gecko_cmd_mesh_node_request_ivupdate();
        }
        break;
    case TIMER_ID_CONN_TIMEOUT:
        // disconnect from remote
        MI_LOG_INFO("Gatt timeout %d sec, disconnect handle %04x\n", GATT_CONN_TIMEOUT, conn_handle);
        if (conn_handle != 0xFF) {
            gecko_cmd_le_connection_close(conn_handle);
        }
        break;
    default:
        break;
    }
}

/**
 * Handling of stack events. Both BLuetooth LE and Bluetooth mesh events are handled here.
 */
#define USE_DUMMY_CERT  0
static uint8_t mesh_scan_level;
int mi_mesh_otp_carry_nvm3(void);
void mible_mesh_stack_event_handler(struct gecko_cmd_packet *evt)
{
    uint16_t result;
    if (NULL == evt) {
        return;
    }

    switch (BGLIB_MSG_ID(evt->header)) {
    case gecko_evt_hardware_soft_timer_id:
        process_soft_timer_event(evt);
        break;
    case gecko_evt_system_boot_id:
#if defined(WATCH_DOG_ENABLE) && WATCH_DOG_ENABLE
        // Configure and Initialize the Watchdog timer
        initWDOG();
#endif
#if USE_CARRY_CERT==2
        mi_mesh_otp_carry_nvm3();
#endif
#if USE_DUMMY_CERT==1
    {
        extern unsigned char dev_mac[6];

        bd_addr new_mac = {0};
        memcpy(new_mac.addr, dev_mac, 6);

        bd_addr curr_mac = gecko_cmd_system_get_bt_address()->address;
        MI_LOG_HEXDUMP(&curr_mac, 6);
        if (memcmp(curr_mac.addr, new_mac.addr, 6) != 0) {
            gecko_cmd_system_set_bt_address(new_mac);
            gecko_cmd_system_reset(0);
        }
    }
    result = mi_mesh_otp_program_simulation();
    MI_ERR_CHECK(result);
#endif
        MI_LOG_WARNING("[Stack event] gecko_evt_system_boot_id\n");
        mi_service_init();
        mible_set_tx_power(85);
        result = gecko_cmd_hardware_set_soft_timer(MS_2_TIMERTICK(1000), TIMER_ID_POLL_SECOND, 0)->result;
        MI_ERR_CHECK(result);
        mible_mesh_event_callback(MIBLE_MESH_EVENT_STACK_INIT_DONE, NULL);
        break;
    case gecko_evt_mesh_node_initialized_id:
        MI_LOG_WARNING("[Stack event] gecko_evt_mesh_node_initialized_id\n");
        local_config_init();
        process_mesh_node_init_event(evt);
        break;
    case gecko_evt_mesh_node_changed_ivupdate_state_id:
        MI_LOG_WARNING("[Stack event] evt gecko_evt_mesh_node_changed_ivupdate_state_id, ivindex = %x, state %d\r\n",
               evt->data.evt_mesh_node_changed_ivupdate_state.ivindex, evt->data.evt_mesh_node_changed_ivupdate_state.state);
        process_mesh_iv_update_event(evt->data.evt_mesh_node_changed_ivupdate_state.ivindex,
                                    evt->data.evt_mesh_node_changed_ivupdate_state.state);
        break;
    case gecko_evt_mesh_node_ivrecovery_needed_id:
        MI_LOG_WARNING("[Stack event] evt gecko_evt_mesh_node_ivrecovery_needed_id, network_ivindex = %x, node_ivindex = %x\r\n",
               evt->data.evt_mesh_node_ivrecovery_needed.network_ivindex, evt->data.evt_mesh_node_ivrecovery_needed.node_ivindex);
        gecko_cmd_mesh_node_set_ivrecovery_mode(1);
        process_mesh_iv_update_event(evt->data.evt_mesh_node_ivrecovery_needed.network_ivindex, 0);
        break;
#if defined(MI_MESH_TEMPLATE_LIGHTNESS) || defined(MI_MESH_TEMPLATE_LIGHTCTL) || defined(MI_MESH_TEMPLATE_ONE_KEY_SWITCH) \
    || defined(MI_MESH_TEMPLATE_TWO_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_THREE_KEY_SWITCH) || defined(MI_MESH_TEMPLATE_FAN)
    case gecko_evt_mesh_generic_server_client_request_id:
        MI_LOG_WARNING("[Stack event] server_client_request\r\n");
        mesh_lib_generic_server_event_handler(evt);
        break;
    case gecko_evt_mesh_generic_server_state_changed_id:
        MI_LOG_WARNING("[Stack event] server_state_changed\r\n");
        // pass the server state changed event to mesh lib handler that will invoke
        // the callback functions registered by application
        // mesh_lib_generic_server_event_handler(evt);
        break;
#endif
    case gecko_evt_mesh_vendor_model_receive_id:
        MI_LOG_WARNING("[Stack event] vendor_model_receive\r\n");
        process_mesh_vendor_model_recv_event(evt);
        break;
    case gecko_evt_mesh_node_model_config_changed_id:
        MI_LOG_WARNING("[Stack event] model_config_changed\r\n");
        process_mesh_node_model_config(evt);
        break;
    case gecko_evt_mesh_node_config_set_id:
        MI_LOG_WARNING("[Stack event] config_set\r\n");
#if !MINIMIZE_FLASH_SIZE
        process_mesh_node_config_set(evt);
#endif
        break;
    case gecko_evt_mesh_node_reset_id:
        MI_LOG_WARNING("[Stack event] evt gecko_evt_mesh_node_reset_id\r\n");
        process_mesh_node_reset(evt);
        break;

    case gecko_evt_le_connection_opened_id:
        conn_handle = evt->data.evt_le_connection_opened.connection;
        MI_LOG_WARNING("[Stack event] gecko_evt_le_connection_opened_id: %d\n", evt->data.evt_le_connection_opened.advertiser);
        mesh_scan_level = mible_mesh_device_scan_get();
        result = gecko_cmd_le_gap_end_procedure()->result;
        MI_ERR_CHECK(result);
        result = gecko_cmd_le_gap_set_discovery_timing(1, 200, 40)->result;
        MI_ERR_CHECK(result);
        result = gecko_cmd_le_gap_start_discovery(1, 2)->result;
        MI_ERR_CHECK(result);
        result = gecko_cmd_hardware_set_soft_timer(SEC_2_TIMERTICK(GATT_CONN_TIMEOUT), TIMER_ID_CONN_TIMEOUT, 1)->result;
        MI_ERR_CHECK(result);
        break;
    case gecko_evt_le_connection_closed_id:
        conn_handle = 0xFF;
        MI_LOG_WARNING("[Stack event] conn closed, reason 0x%x\r\n", evt->data.evt_le_connection_closed.reason);
        result = mible_mesh_device_scan_set(mesh_scan_level);
        MI_ERR_CHECK(result);
        result = gecko_cmd_hardware_set_soft_timer(0, TIMER_ID_CONN_TIMEOUT, 1)->result;
        MI_ERR_CHECK(result);
        break;
    case gecko_evt_le_connection_parameters_id:
        MI_LOG_WARNING("[Stack event] gecko_evt_le_connection_parameters_id: conn %d, int %d, latency %d, timeout %d\n",
                evt->data.evt_le_connection_parameters.connection, evt->data.evt_le_connection_parameters.interval,
                evt->data.evt_le_connection_parameters.latency, evt->data.evt_le_connection_parameters.timeout);
        break;
    default:
        //      MI_LOG_INFO("unhandled evt: %8.8x class %2.2x method %2.2x\r\n", evt_id, (evt_id >> 16) & 0xFF, (evt_id >> 24) & 0xFF);
        break;
    }
}

/**
 * Replace otp api and store mesh Certificate chain in NVM3.
 */
#include "cryptography/mi_mesh_otp.h"
#include "nvm3.h"
#include "nvm3_default.h"
#define MIBLE_POTP_TAG_REC_ID_BASE          0x48
#define MIBLE_POTP_DEV_REC_ID_BASE          0x49
#define MIBLE_POTP_MANU_REC_ID_BASE         0x4A
#define MIBLE_POTP_ROOT_REC_ID_BASE         0x4B
#define MIBLE_POTP_DEV_PRI_REC_ID_BASE      0x4C
#define MIBLE_POTP_MAC_REC_ID_BASE          0x4E
#define MIBLE_POTP_MATA_REC_ID_BASE         0x4F

