MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
#define MIBLE_POTP_TAG_SIZE                 8
#define MIBLE_POTP_CERT_SIZE                512
#define MIBLE_POTP_PRI_SIZE                 36
#define MIBLE_POTP_MAC_SIZE                 6

int mi_mesh_otp_seal_tag(uint8_t * base)
{
    otp_head_t head = {
            .name       = "POTP",
            .version    = 1,
            .size       = POTP_FULL_SIZE
    };

    return nvm3_writeData(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_TAG_REC_ID_BASE, (void*)&head, MIBLE_POTP_TAG_SIZE);
}

int mi_mesh_otp_write(uint16_t item_type, const uint8_t *p_in, uint16_t in_len)
{
    uint8_t buff[MIBLE_POTP_CERT_SIZE];
    uint32_t type = MIBLE_POTP_MATA_REC_ID_BASE;

    buff[0] = item_type;
    buff[1] = item_type >> 8;
    buff[2] = in_len;
    buff[3] = in_len >> 8;
    memcpy(buff+4, p_in, in_len);

    if(item_type < 0x06){
        type = MIBLE_POTP_TAG_REC_ID_BASE + item_type;
    }else if(item_type == OTP_BLE_MAC){
        type = MIBLE_POTP_MAC_REC_ID_BASE;
    }else if(item_type == OTP_META_DATA){
        type = MIBLE_POTP_MATA_REC_ID_BASE;
    }else{
        return -1;
    }

    return nvm3_writeData(nvm3_defaultHandle, 0x44000 + type, (void*)buff, in_len + 4);
}

int mi_mesh_otp_read(uint16_t item_type, uint8_t *p_out, uint16_t out_len)
{
    uint8_t buff[MIBLE_POTP_CERT_SIZE];
    uint32_t type = MIBLE_POTP_MATA_REC_ID_BASE;

    if(item_type < 0x06){
        type = MIBLE_POTP_TAG_REC_ID_BASE + item_type;
    }else if(item_type == OTP_BLE_MAC){
        type = MIBLE_POTP_MAC_REC_ID_BASE;
    }else if(item_type == OTP_META_DATA){
        type = MIBLE_POTP_MATA_REC_ID_BASE;
    }else{
        return -1;
    }

    uint32_t result, nvm3_type, len;
    result = nvm3_getObjectInfo(nvm3_defaultHandle, 0x44000 + type, &nvm3_type, (size_t *)&len);
    MI_ERR_CHECK(result);
    if(result == ECODE_NVM3_OK){
        result = nvm3_readData(nvm3_defaultHandle, 0x44000 + type, (void *)buff, len);
        MI_ERR_CHECK(result);
    }
    if(result != ECODE_NVM3_OK){
        return -3;
    }

    otp_item_t *item = (otp_item_t *)buff;

    if (p_out != NULL && item->len > len)
        return -2;

    if (p_out != NULL) {
        memcpy(p_out, buff + offsetof(otp_item_t, value), item->len);
    }

    return item->len;
}

bool mi_mesh_otp_is_existed(void)
{
    uint32_t result, type, len;

    result = nvm3_getObjectInfo(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_ROOT_REC_ID_BASE, &type, (size_t *)&len);
    MI_ERR_CHECK(result);
    if(result){
        MI_LOG_WARNING("root cert isn't existed!\n");
        return false;
    }

    result = nvm3_getObjectInfo(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_MANU_REC_ID_BASE, &type, (size_t *)&len);
    MI_ERR_CHECK(result);
    if(result){
        MI_LOG_WARNING("manu cert isn't existed!\n");
        return false;
    }

    result = nvm3_getObjectInfo(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_DEV_REC_ID_BASE, &type, (size_t *)&len);
    MI_ERR_CHECK(result);
    if(result){
        MI_LOG_WARNING("dev cert isn't existed!\n");
        return false;
    }

    result = nvm3_getObjectInfo(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_DEV_PRI_REC_ID_BASE, &type, (size_t *)&len);
    MI_ERR_CHECK(result);
    if(result){
        MI_LOG_WARNING("dev pri isn't existed!\n");
        return false;
    }

    result = nvm3_getObjectInfo(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_TAG_REC_ID_BASE, &type, (size_t *)&len);
    MI_ERR_CHECK(result);
    if(result){
        MI_LOG_WARNING("otp tag isn't existed!\n");
        return false;
    }

    otp_head_t head;
    MI_LOG_WARNING("nvm3_readData : actual size %d\n", len);
    result = nvm3_readData(nvm3_defaultHandle, 0x44000 + MIBLE_POTP_TAG_REC_ID_BASE, (void *)&head, sizeof(otp_head_t));
    MI_ERR_CHECK(result);

    if( memcmp(head.name, "POTP", 4) == 0 &&
        head.version == 1 &&
        head.size == POTP_FULL_SIZE)
        return true;
    else
        return false;
}

#if USE_CARRY_CERT==2
#define POTP_CARRY_BASE             ((uint8_t*)0x76000UL)
#include "cryptography/mi_mesh_otp.h"

static uint8_t *find_item2(uint8_t *p_base, uint16_t item_type)
{
    /* Check POTP header */
    otp_head_t head = {0};
    mible_nvm_read(&head, sizeof(head), (uint32_t)p_base);
    if (memcmp(head.name, "POTP", 4) != 0) {
        MI_LOG_ERROR("no mesh otp found.\n");
        return NULL;
    } else if (head.version > 1) {
        MI_LOG_ERROR("this version is not supported.\n");
        return NULL;
    }

    /* Find TYPE item */
    otp_item_t item;
    uint8_t* item_addr = p_base + sizeof(otp_head_t);
    mible_nvm_read(&item, 4, (uint32_t)item_addr);
    while(item.type != item_type && item_addr < POTP_CARRY_BASE+POTP_FULL_SIZE) {
        item_addr += offsetof(otp_item_t, value) + CEIL_DIV(item.len, 4) * 4;
        mible_nvm_read(&item, 4, (uint32_t)item_addr);
    }

    if (item_addr > POTP_CARRY_BASE + POTP_FULL_SIZE)
        return NULL;
    else
        return item_addr;
}

static int mi_mesh_otp_read2(uint16_t item_type, uint8_t *p_out, uint16_t len)
{
    uint8_t *p = find_item2(POTP_CARRY_BASE, item_type);

    if (p == NULL)
        return -1;

    otp_item_t item;
    mible_nvm_read(&item, sizeof(otp_item_t), (uint32_t)p);

    if (p_out != NULL && item.len > len)
        return -2;

    if (p_out != NULL) {
        p += offsetof(otp_item_t, value);
        mible_nvm_read(p_out, item.len, (uint32_t)p);
    }

    return item.len;

}

static bool mi_mesh_otp_is_existed2(void)
{
    otp_head_t head_data;
    mible_nvm_read((void *)(&head_data), sizeof(head_data), (uint32_t)POTP_CARRY_BASE);
    otp_head_t *head = &head_data;
    if( memcmp(head->name, "POTP", 4) == 0 &&
        head->version == 1 &&
        head->size == POTP_FULL_SIZE)
        return true;
    else
        return false;
}

int mi_mesh_otp_carry_nvm3(void)
{
    int errno = 0,len;
    uint8_t buff_cert[512];

#if 1
    if (!mi_mesh_otp_is_existed())
#endif
    {
        MI_LOG_WARNING("NVM3 can't find POTP\n");
        if(!mi_mesh_otp_is_existed2()){
            MI_LOG_ERROR("can't find potp in %d\n", (uint32_t)POTP_CARRY_BASE);
            return -1;
        }

