MiEcosystem/mijia_ble_api/efr32_soc_mesh.c
        bd_addr new_mac = {0};
        if(sizeof(new_mac.addr) != mi_mesh_otp_read(OTP_BLE_MAC, new_mac.addr, sizeof(new_mac.addr)))
        {
            len = mi_mesh_otp_read2(OTP_BLE_MAC, new_mac.addr, sizeof(new_mac.addr));
            MI_ERR_CHECK(len);
            if(len == sizeof(new_mac.addr)){
                MI_LOG_WARNING("Set bt Mac :\n");
                MI_LOG_HEXDUMP(new_mac.addr, 6);
                errno = mi_mesh_otp_write(OTP_BLE_MAC, new_mac.addr, len);
                MI_ERR_CHECK(errno);
                gecko_cmd_system_set_bt_address(new_mac);
                MI_LOG_WARNING("mesh_node_reset\n");
                errno = mible_mesh_node_reset();
                MI_ERR_CHECK(errno);
                errno = mible_reboot();
                MI_ERR_CHECK(errno);
                return -2;
            }else{
                return -3;
            }
        }

        MI_LOG_WARNING("carry mesh otp\n");
        errno = mi_mesh_otp_seal_tag(POTP_CARRY_BASE);
        MI_ERR_CHECK(errno);

        len = mi_mesh_otp_read2(OTP_ROOT_CERT, buff_cert, sizeof(buff_cert));
        MI_ERR_CHECK(len);
        if(len > 0){
            errno = mi_mesh_otp_write(OTP_ROOT_CERT, buff_cert, len);
            MI_ERR_CHECK(errno);
        }

        len = mi_mesh_otp_read2(OTP_MANU_CERT, buff_cert, sizeof(buff_cert));
        MI_ERR_CHECK(len);
        if(len > 0){
            errno = mi_mesh_otp_write(OTP_MANU_CERT, buff_cert, len);
            MI_ERR_CHECK(errno);
        }

        len = mi_mesh_otp_read2(OTP_DEV_CERT, buff_cert, sizeof(buff_cert));
        MI_ERR_CHECK(len);
        if(len > 0){
            errno = mi_mesh_otp_write(OTP_DEV_CERT, buff_cert, len);
            MI_ERR_CHECK(errno);
        }

        len = mi_mesh_otp_read2(OTP_DEV_CERT_PRI, buff_cert, sizeof(buff_cert));
        MI_ERR_CHECK(len);
        if(len > 0){
            errno = mi_mesh_otp_write(OTP_DEV_CERT_PRI, buff_cert, len);
            MI_ERR_CHECK(errno);
        }

        errno = mi_mesh_otp_verify();
    }

    return errno;
}
#endif
